Documents/ESB/ESB_Consumer_0605/003TestSample/SAMPLE_XML_MUST/Loan/LO07_LoanAcctOpnRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Loan/LoanAcctOpnRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Loan</ServiceDomain>  
      <OperationName>LoanAcctOpn</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:LoanAcctOpnRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>LO07</v11:TxnId>  
        <v11:TxnNo>LO0700001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <!--Optional:-->  
        <v11:ValidateOnly>false</v11:ValidateOnly>  
        <!--Optional:-->  
        <v11:ArrngId>NEW</v11:ArrngId>  
        <!--1 or more repetitions:-->  
        <v11:CustRec> 
          <v11:CIFNo>1000000177</v11:CIFNo> 
        </v11:CustRec>  
        <v11:ProdName>AL.TERM.LN</v11:ProdName>  
        <v11:Ccy>TWD</v11:Ccy>  
        <v11:EffDate>STR</v11:EffDate>  
        <!--Optional:-->  
        <v11:AcctInfo> 
          <!--Optional:-->  
          <v11:GLTerm>51</v11:GLTerm>  
          <!--Optional:-->  
          <v11:OvrdIntrstDate>20191203</v11:OvrdIntrstDate> 
        </v11:AcctInfo>  
        <!--Optional:-->  
        <v11:InExtFeeRec> 
          <!--Optional:-->  
          <v11:FixAmt>100</v11:FixAmt> 
        </v11:InExtFeeRec>  
        <!--Optional:-->  
        <v11:DsbrFeeRec> 
          <!--Optional:-->  
          <v11:FixAmt>1000</v11:FixAmt>  
          <v11:TierTypeRec></v11:TierTypeRec> 
        </v11:DsbrFeeRec>  
        <!--Optional:-->  
        <v11:MntncFeeInfo> 
          <!--Optional:-->  
          <v11:FixAmt>1000</v11:FixAmt>  
          <v11:TierTypeRec></v11:TierTypeRec> 
        </v11:MntncFeeInfo>  
        <!--Optional:-->  
        <v11:OvdFeeRec> 
          <!--Optional:-->  
          <v11:FixAmt>400</v11:FixAmt>  
          <v11:TierTypeRec></v11:TierTypeRec> 
        </v11:OvdFeeRec>  
        <!--Optional:-->  
        <v11:PrncplIntrstRec></v11:PrncplIntrstRec>  
        <!--Optional:-->  
        <v11:PnltyIntrstRec> 
          <v11:IntrstRateRec> 
            <!--Optional:-->  
            <v11:FixRate>0.0</v11:FixRate>  
            <v11:MargRec></v11:MargRec> 
          </v11:IntrstRateRec> 
        </v11:PnltyIntrstRec>  
        <!--Optional:-->  
        <v11:LmtInfo> 
          <!--Optional:-->  
          <v11:LmtRefNo>8100</v11:LmtRefNo>  
          <!--Optional:-->  
          <v11:LmtSeqNo>02</v11:LmtSeqNo> 
        </v11:LmtInfo>  
        <!--Optional:-->  
        <v11:PmtRec></v11:PmtRec>  
        <!--1 or more repetitions:-->  
        <v11:SettlemInfo> 
          <v11:DbAcctFlg>YES</v11:DbAcctFlg>  
          <v11:CrAcctFlg>YES</v11:CrAcctFlg> 
        </v11:SettlemInfo>  
        <v11:CmmtmntInfo> 
          <v11:LoanAmt>40000</v11:LoanAmt>  
          <!--Optional:-->  
          <v11:MtrtyDate>20200503</v11:MtrtyDate>  
          <!--Optional:-->  
          <v11:RcvrType>NO</v11:RcvrType>  
          <!--Optional:-->  
          <v11:LmtModFlg>YES</v11:LmtModFlg> 
        </v11:CmmtmntInfo>  
        <!--Optional:-->  
        <v11:IPAddr>IP 172.100.10.22</v11:IPAddr>  
        <!--Optional:-->  
        <v11:APIKey>NCB-IF05003</v11:APIKey> 
      </v11:ServiceBody> 
    </v11:LoanAcctOpnRq> 
  </soap:Body> 
</soap:Envelope>
